app/controllers/alumnis_controller.rb

SELECT * FROM `alumnis` WHERE (`alumnis`.`id` = 2053932786)
---
  def show
    @alumni = Alumni.find(params[:id])

INSERT INTO `alumnis` (`name`, `created_at`, `updated_at`, `password`, `email`) VALUES('sample', '2009-09-09 06:14:30', '2009-09-09 06:14:30', 'demo', 'sample@gmail.com')
---
  def create
    params[:alumni][:user_id] = session[:register_user_id] if !logged_in?
    @alumni = Alumni.new(params[:alumni])
    @courses = Course.find(:all,:order => "name")
    @universities = University.find(:all,:order => "name")

    respond_to do |format|
      if @alumni.save

SELECT * FROM `alumnis` GROUP BY user_id, university_id
---
  def search
    @alumnis = Alumni.search(params)