app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `username`, `remember_token_expires_at`, `activation_code`, `remember_token`, `email`, `created_at`) VALUES('', '760625388f5de275265b8848ae7648ed0daeb47f', '2009-09-10 01:31:19', NULL, 'c312260eacd8695de258c0ea35c3855210dfc0de', 'kemila', NULL, '17393a22820bf031e6668f09ac60af75ae1dc0ba', NULL, 'ayah@dddd.com', '2009-09-10 01:31:19')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save && @user.errors.empty?

SELECT * FROM `users` WHERE (`users`.`activation_code` = '19f2ceb25e1570229d424c2a1c8e01d313b98576') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?